package com.yuan.lifefinance.tool;

/**
 * copyright:华润创业(深圳)有限公司
 * author:admin
 * create_date:2019/7/26 9:54
 * <p>
 * describe:TODO
 */
public class BuySaleOrder {
// 挂单详情记录：
// 深天马A----------------------------------------
// 20190726
// 09:45-》关键点位出现1000手以上托单，买单大于卖单
// 10:00-》托单消失，卖单大于买单
// 10:10-》关键点位出现1000手以上托单，买单大于卖单
// 11:00-》卖单大于买单
// 14:22-》买单大于卖单，未有明显大托单
// 14:55-》买单大于卖单，未有明显大托单
// 20190729
// 10:10-》14.68点位出现2600手托单，买单大于卖单
// 10:50-》卖单大于买单
// 11:10-》卖单大于买单
// 14:05-》卖单大于买单
// 20190730
// 10:00-》买单大于卖单，相差不明显
// 10:30-》卖单大于买单，相差不明显
// 11:00-》卖单大于买单，但15.00位置出现1000手以上大托单
// 13:30-》买单大于卖单，出现批量托单趋势
// 14:30-》买单大于卖单，出现批量托单趋势
// 20190731
// 10:00-》买单大于卖单，相差不明显
// 10:30-》卖单大于买单，相差不明显
// 11:00-》相差不大，买卖单均衡
// 13:30-》相差不大，买卖单均衡
// 14:30-》上有压单，下有托单，差异不大
// 20190801
// 10:00-》买单大于卖单，关键位置有大托单
// 10:30-》买单大于卖单，相差不明显
// 11:00-》相差不大，买卖单均衡
// 13:30-》相差不大，买卖单均衡
// 14:30-》相差不大，买卖单均衡
// 20190802 -》大盘30分钟破位
// 10:00-》相差不大，买卖单均衡
// 10:30-》相差不大，买卖单均衡
// 11:00-》相差不大，买卖单均衡
// 13:30-》相差不大，买卖单均衡
// 14:30-》相差不大，买卖单均衡



//趋势走势结构分析
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
}
