package com.yuan.lifefinance.tool;

public class DicText {
	
	//测试

    //6月备注【81889】
    public static String[] getMonth6NameArray(){
        String[] value = {
                "2019-06-[11-亚盛股份]",//目标价格【】止损价格【3.40】  最终收益：
                //6-11&农业板块，因为龙头涨幅都较大，相对不安全，买入此股博取短线补涨机会，大盘今天放量短线有博取机会，风险较小，可适当持股，筹码未突破不参考
                //6-12&止损：3.60

                "2019-06-[11-综艺股份]",//目标价格【】止损价格【7.00】 最终收益：
                //6-11&半导体板块，国产芯片，多概念龙头，周线符合成交量形态个股，当前涨幅不大，可以适当低吸，今天跑输板块，处于板块下游，明天有希望领涨板块
                //6-12&止损：7.38


                "",
                "",
                "",
                "2019-05-[24-？]四维图新||中国联通"
                //6-11&未有介入机会，等待回调
        };
        return value;
    }
}
