package com.yuan.lifefinance.tool;

import org.junit.Test;

/**
 * copyright:华润创业(深圳)有限公司
 * author:admin
 * create_date:2019/7/29 10:03
 * <p>
 * describe:TODO
 */
public class FundStock {
    @Test
    public void test012(){
        double[] value = {0.03,-0.02};
    }
//买卖原则：1.大盘日线上涨过程中，个股买周线买点附近的，2.周线杀跌是要回避【30分钟3卖出现、日线无量】
//个人基金建仓  总资金：141000  &:每一个月需要检查替换质地较差个股
//---------------------------------第一批20190729【8月】剩余本金：？收益率：？
//科大讯飞39.40//盐津铺子42.90//同花顺133//中国联通7.30//东方证券12.75//中国国航11.80//中科曙光39.40
//---------------------------------第二批20190901【9月】剩余本金：？收益率：？
}
