package com.yuan.lifefinance.tool;

import com.yuan.lifefinance.tool.bean.StockInfoBuyBeans;

import java.util.ArrayList;
import java.util.List;

/**
 * copyright:华润创业(深圳)有限公司
 * author:admin
 * create_date:2019/8/5 10:10
 * <p>
 * describe:个股操作记录
 * 原则：2只以上，分仓操作，周期一个月以上，不追涨，只买跌
 */
public class StockRecord {


//    操作模式：1.大级别【日线级别以上】出现买点，买入底仓，中途用额外资金做T操作,但一旦达到目标，底仓卖完，就没有操作机会
//              2.大级别没确认买点之前，要随时快进快出
//    20190805：第一批
//            &士兰微 ->：理由：个股月线突破的回调，半导体行业有想象空间  【成本：14.33->1400  止损：14.00】【目标->17.30目标->目标->】【支撑：15.83】
//                        第一阶段[目标冲击17.30]最终盈利：+5000[20190802--20190916][止损：13.25][注：可保持少量仓位持股博新高，17.30止损]
//                        第二阶段[目标冲击20.21]最终盈利：[]
//            四维图新->: 理由：计算机板块强势行情，个股处于车联网龙头，做周线2买反弹【成本：16.56->1500止损：16.00】【目标->20.30目标->目标->】
//                        第一阶段[目标冲击20.30]最终盈利：[20190905--]
//            紫光国微->：理由：半导体行业突破，个股走势有月线突破趋势，逢低建仓原则 【成本:51.20->500 止损：51.61】【目标->60.65目标->目标->】
//                        第一阶段[目标冲击60.65]最终盈利：+1700[20190820--20190904]
//                        第二阶段[目标冲击60.65新高后60分钟1卖]最终盈利：[20190912--][止损：53.22]
//            中国人寿->：理由：权重蓝筹，月线有突破趋势 【成本：30.29->700 止损：28.27】【目标->31目标->34.80目标->】
//                        2019-09-23卖出：最终盈利：-1400[走势太纠结，退出观望，短期重点操作半导体]
//            天齐锂业->：理由：周线有1买背驰趋势，跌幅巨大，公司属于锂矿龙头 【成本:26.98->1700 止损：23】【目标->25.30目标->27.60目标->35.00】

    public static List<StockInfoBuyBeans> getStockInfoBuyList(){
        //注意：只关注年线之上的票
        List<StockInfoBuyBeans> stock = new ArrayList<>();
        stock.add(
                new StockInfoBuyBeans("20190709",25.94,"天齐锂业",27.14,1200,27.61,"20191111",21.45));
        stock.add(
                new StockInfoBuyBeans("20190923",15.14,"睿能科技",15.36,1100,18.35,"20190926",15.15));
        stock.add(
                new StockInfoBuyBeans("20190905",17.05,"四维图新",16.56,1200,22.41,"20190927",17.26));
        stock.add(
                new StockInfoBuyBeans("20190925",34.30,"饕数据港",34.61,700,43.01,"20191025",32.61));
        stock.add(
                new StockInfoBuyBeans("20191025",4.51,"广博股份",4.65,3300,5.33,"20191030",5.29));
        stock.add(
                new StockInfoBuyBeans("20191028",3.63,"乂京东方",3.74,4500,4.18,"20191030",3.66));
        stock.add(
                new StockInfoBuyBeans("20191030",29.78,"饕数据港",31.82,700,43.01,"20191106",32.49));
        stock.add(
                new StockInfoBuyBeans("20190912",56.56,"紫光国威",57.65,500,73.07,"20191111",45.81));
        stock.add(
                new StockInfoBuyBeans("20191106",3.59,"乂京东方",3.62,7600,4.01,"20191111",3.61));
        stock.add(
                new StockInfoBuyBeans("20191108",14.76,"乂士兰微",15.30,1000,17.40,"20191112",14.72,"年线上方运行"));
        stock.add(
                new StockInfoBuyBeans("20191112",44.30,"紫光国威",44.40,300,46.80,"20191114",45.70,""));
        stock.add(
                new StockInfoBuyBeans("20191114",24.82,"天齐锂业",27.02,800,29.01,"20191119",27.04,"攻击年线后的回调"));
        stock.add(
                new StockInfoBuyBeans("20191119",47.90,"紫光国威",48.25,400,48.80,"20191121",47.10,""));
        stock.add(
                new StockInfoBuyBeans("20191122",11.16,"万向德农",11.54,1900,12.80,"20191126",10.84,""));
        stock.add(
                new StockInfoBuyBeans("20191224",15.80,"乂士兰微",15.90,600,16.20,"20191225",15.89,"博短线反弹"));
        stock.add(
                new StockInfoBuyBeans("20191224",6.27,"达华智能",6.28,1500,6.76,"20191225",6.39,"重点关注农业股"));
        stock.add(
                new StockInfoBuyBeans("20191226",16.35,"乂士兰微",16.44,1100,17.40,"20191230",15.75,""));
        stock.add(
                new StockInfoBuyBeans("20191107",8.40,"中国国航",8.78,3300,9.99,"20191230",8.55,"当前攻击年线"));
        stock.add(
                new StockInfoBuyBeans("20191230",5.09,"云铝股份",5.16,3900,6.11,"20191231",5.10,""));
        stock.add(
                new StockInfoBuyBeans("20191126",24.82,"天齐锂业",27.71,600,33.41,"20190103",30.74,"攻击年线后的回调"));

//     【2020年重点股票关注：
//             [==================一季度==================]
//             万象德农[农业政策扶持]短期
//             葛洲坝[建筑一季度有政策反弹机会]一季度
//             二六三[业绩预增-网络直播]短期
//             青岛双星[中韩自贸区春季]短期

//             [==================二三四季度==================]
//             中科三环[全年受益于新能源汽车特斯拉永磁]
//             万马股份【需要等待大跌】
//             数据港【需要等待2月10号的解禁】
//     】
        stock.add(
                new StockInfoBuyBeans("20191231",6.38,"乂葛洲坝",6.44,2800,7.33,"20200107",6.68,""));
        stock.add(
                new StockInfoBuyBeans("20200106",5.40,"乂二六三",5.75,6000,7.2,"20200109",5.68,"股股性不活卖出换股"));
        stock.add(
                new StockInfoBuyBeans("20200108",4.69,"青岛双星",4.96,3000,6.01,"20200113",4.86,""));
        stock.add(
                new StockInfoBuyBeans("20200108",2.43,"乂搜于特",2.49,8000,3.61,"20200115",2.43,"第一波放量开始回调先出局"));
        stock.add(
                new StockInfoBuyBeans("20200113",2.43,"乂三力士",6.55,2500,8.11,"20200116",6.86,"卖出避免逆势上涨后的补跌概率"));
        stock.add(
                new StockInfoBuyBeans("20200117",2.43,"乂搜于特",2.45,7800,3.61,"20200117",2.43,"第一波放量开始回调先出局"));
        stock.add(
                new StockInfoBuyBeans("20200115",3.65,"山鹰纸业",3.71,4000,3.91,"20200207",3.49,"股性较弱，出局观望"));
        stock.add(
                new StockInfoBuyBeans("20200123",9.97,"中科三环",11.01,1400,14.14,"20200218",11.62,"同板块换股-金力永磁"));
        stock.add(
                new StockInfoBuyBeans("20200123",14.84,"乂士兰微",15.32,700,16.10,"20200212",16.01,""));
        stock.add(
                new StockInfoBuyBeans("20200218",35.70,"金力永磁",35.74,800,45.12,"20200219",36.63,""));
        stock.add(
                new StockInfoBuyBeans("20191209",11.16,"万向德农",11.43,3600,14.70,"20200412",13.40,"0115:【12.81卖出1200股】、0217:【13.11全部卖出保留100股】"));
        stock.add(
                new StockInfoBuyBeans("20200217",10.80,"登海种业",11.15,3200,12.81,"20200412",11.63,"万向德农轮换-》换股大北农"));
        stock.add(
                new StockInfoBuyBeans("20200218",7.52,"乂三力士",7.59,2400,9.96,"20200408",8.31,""));
        stock.add(
                new StockInfoBuyBeans("20200330",13.98,"中环股份",15.18,1100,16.37,"切换仓位博半导体反弹",0,""));
        stock.add(
                new StockInfoBuyBeans("20200330",6.21,"哈投股份",6.88,2500,6.89,"切换仓位博大盘反弹拉盘",0,""));
        stock.add(
                new StockInfoBuyBeans("20200403",5.79,"张家港行",5.83,3500,6.09,"个股放量有博拉盘概率",0,""));
        stock.add(
                new StockInfoBuyBeans("20200409",8.03,"大北农",8.21,1900,9.39,"20200415",8.31,""));
        stock.add(
                new StockInfoBuyBeans("20200416",8.28,"大北农",8.57,4200,9.39,"20200419",8.99,""));

        //        ========================================================================================================================
//        stock.add(new StockInfoBuyBeans("20191113",29.78,"饕数据港",0,0,43.01,"准备阶段-等60分钟杀跌的1买或者2买//15分钟有机会出3买，当前周线处于类2买止跌反弹",0,"跌到年线支撑位"));


        return stock;
}
//        【月线买点】：最保险的是做周线一笔反弹，[需要30分钟出3买,日线回调背驰买入最稳妥]
//        【周线买点】：最保险的是做日线一笔反弹，[需要5分钟出3买,30分钟回调背驰买入最稳妥]
//        【日线买点】：最保险的是做30/60分钟一笔反弹，[需要1分钟出3买,5分钟回调背驰买入最稳妥]

//        【 1分钟出3卖】：可能是30分钟杀跌，5分钟反弹要卖
//        【 5分钟出3卖】：可能是日线杀跌，30分钟反弹要卖
//        【30分钟出3卖】：可能是周线杀跌，日线反弹要卖
//        【日线出3卖】：可能是月线杀跌，周线反弹要卖

}
