package com.yuan.lifefinance.tool;

/**
 * copyright:华润创业(深圳)有限公司
 * author:admin
 * create_date:2019/7/5 16:40
 * <p>
 * describe:TODO
 */
public class 总结 {
//    短线关注点：
//    1.周线成交量形态
//    2.尽量龙头
//    3.低位上影线和下影线等长的上量形态

//    长线操作要点
//    1.现阶段只T日现上涨一笔，日线回调不做T，除非是日线回调到位
//    2.没有达到上量形态不T,除非跌幅巨大
//    3.要注意日线的获利了结，日线顶分型处要减仓
//    4.初始危险阶段【周线结束-30分钟出3卖】时候，只能做30分钟反弹，买入一定要等5分钟背驰【5分钟有底分型最佳】
//    5.博日线上涨一笔只关注：1.30分钟1买  2.大盘5分钟的3买位置   3.3买之后30分钟回调1买

//    分时看盘要点
//    5分钟跌破趋势[关键位置:比如每隔一毛钱就出现大托单，上方卖单却很少]，分时出现每个节点放量砸盘，那么早盘应该卖票，尾盘再买回
}


//操作犯错记录：
//1.不管走势多么好看，买店成本一定要位于大级别的买点附近
//2.除权很多的票半年内坚决不碰
//3.不能随意买店卖店
//4.长线只关注不超过三只票
//5.成功的前提是注重目标，不管目标是否合理，一定要坚持设定目标。  20190724
//6.长线短线都要设置止损，破止损《必须》走  20190725
//7.尽量只做国资盘，这样即使被套也相对安全  20190725